const settings = require('../settings');
const fs = require('fs');
const path = require('path');

async function helpCommand(sock, chatId, message) {
    const helpMessage = `
*╭┈──〔 *𓆩ု𝐒𝐇𝐀𝐇𝐈𝐍𓆪* 〕┈──⊷
*│🕊️ ${settings.botName || 'sʜᴀʜɪɴツʀᴀɴᴀ'}*  
*│🎐 *ᴠᴇʀsɪᴏɴ:*  *${settings.version || '3.0.0'}*
*│🎗️ *ʙʏ* ${settings.botOwner || 'sʜᴀʜɪɴツʀᴀɴᴀ'}
*│💎 *ʏᴛ:* *𖣘xᴛʏʟɪsʜ ʀᴀɴᴀ*࿐ツ
*│💠 *ᴍᴏᴅᴇ:* *ᴘʀɪᴠᴀᴛᴇツ*
*│🪄 *ᴘʀᴇғɪx:* .
*│✨ *ᴜsᴇʀ:* *ʜᴇʟʟᴏᴡ ᴜsᴇʀツ*
*│⛲ *ᴘʟᴜɢɪɴs:* 𝟐𝟓𝟑
*│🌏 *ᴢᴏɴᴇ:* *sʏʟʜᴇᴛツᴅʜᴀᴋᴀ*
*╰──────────────────⊷‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎*‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎
 `『 General Commands:』`
*╭───────────────────⳹*
*┋ ⬡ .ʜᴇʟᴘ ᴏʀ .ᴍᴇɴᴜ*
*┋ ⬡ .ᴘɪɴɢ*
*┋ ⬡ .ᴀʟɪᴠᴇ*
*┋ ⬡ .ᴛᴛs <ᴛᴇxᴛ>*
*┋ ⬡ .ᴏᴡɴᴇʀ*
*┋ ⬡ .ᴊᴏᴋᴇ*
*┋ ⬡ .ǫᴜᴏᴛᴇ*
*┋ ⬡ .ғᴀᴄᴛ*
*┋ ⬡ .ᴡᴇᴀᴛʜᴇʀ <ᴄɪᴛʏ>*
*┋ ⬡ .ɴᴇᴡs*
*┋ ⬡ .ᴀᴛᴛᴘ <ᴛᴇxᴛ>*
*┋ ⬡ .ʟʏʀɪᴄs <sᴏɴɢ_ᴛɪᴛʟᴇ>*
*┋ ⬡ .8ʙᴀʟʟ <ǫᴜᴇsᴛɪᴏɴ>*
*┋ ⬡ .ɢʀᴏᴜᴘɪɴғᴏ*
*┋ ⬡ .sᴛᴀғғ ᴏʀ .ᴀᴅᴍɪɴs*
*┋ ⬡ .ᴠᴠ*
*┋ ⬡ .ᴛʀᴛ <ᴛᴇxᴛ> <ʟᴀɴɢ>*
*┋ ⬡ .ss <ʟɪɴᴋ>*
*┋ ⬡ .ᴊɪᴅ*
*┋ ⬡ .ᴜʀʟ*
*╰───────────────────⳹*
`『Admin Commands』`
*╭───────────────────⳹*
*┋ ⬡ .ʙᴀɴ @ᴜsᴇʀ*
*┋ ⬡ .ᴘʀᴏᴍᴏᴛᴇ @ᴜsᴇʀ*
*┋ ⬡ .ᴅᴇᴍᴏᴛᴇ @ᴜsᴇʀ*
*┋ ⬡ .ᴍᴜᴛᴇ <ᴍɪɴᴜᴛᴇs>*
*┋ ⬡ .ᴜɴᴍᴜᴛᴇ*
*┋ ⬡ .ᴅᴇʟᴇᴛᴇ ᴏʀ .ᴅᴇʟ*
*┋ ⬡ .ᴋɪᴄᴋ @ᴜsᴇʀ*
*┋ ⬡ .ᴡᴀʀɴɪɴɢs @ᴜsᴇʀ*
*┋ ⬡ .ᴡᴀʀɴ @ᴜsᴇʀ*
*┋ ⬡ .ᴀɴᴛɪʟɪɴᴋ*
*┋ ⬡ .ᴀɴᴛɪʙᴀᴅᴡᴏʀᴅ*
*┋ ⬡ .ᴄʟᴇᴀʀ*
*┋ ⬡ .ᴛᴀɢ <ᴍᴇssᴀɢᴇ>*
*┋ ⬡ .ᴛᴀɢᴀʟʟ*
*┋ ⬡ .ᴛᴀɢɴᴏᴛᴀᴅᴍɪɴ*
*┋ ⬡ .ʜɪᴅᴇᴛᴀɢ <ᴍᴇssᴀɢᴇ>*
*┋ ⬡ .ᴄʜᴀᴛʙᴏᴛ*
*┋ ⬡ .ʀᴇsᴇᴛʟɪɴᴋ*
*┋ ⬡ .ᴀɴᴛɪᴛᴀɢ <ᴏɴ/ᴏғғ>*
*┋ ⬡ .ᴡᴇʟᴄᴏᴍᴇ <ᴏɴ/ᴏғғ>*
*┋ ⬡ .ɢᴏᴏᴅʙʏᴇ <ᴏɴ/ᴏғғ>*
*┋ ⬡ .sᴇᴛɢᴅᴇsᴄ <ᴅᴇsᴄʀɪᴘᴛɪᴏɴ>*
*┋ ⬡ .sᴇᴛɢɴᴀᴍᴇ <ɴᴇᴡ ɴᴀᴍᴇ>*
*┋ ⬡ .sᴇᴛɢᴘᴘ (ʀᴇᴘʟʏ ᴛᴏ ɪᴍᴀɢᴇ)*
*╰───────────────────⳹*
`『Owner Commands』`
*╭───────────────────⳹*
*┋ ⬡ .ᴍᴏᴅᴇ <ᴘᴜʙʟɪᴄ/ᴘʀɪᴠᴀᴛᴇ>*
*┋ ⬡ .ᴄʟᴇᴀʀsᴇssɪᴏɴ*
*┋ ⬡ .ᴀɴᴛɪᴅᴇʟᴇᴛᴇ*
*┋ ⬡ .ᴄʟᴇᴀʀᴛᴍᴘ*
*┋ ⬡ .ᴜᴘᴅᴀᴛᴇ*
*┋ ⬡ .sᴇᴛᴛɪɴɢs*
*┋ ⬡ .sᴇᴛᴘᴘ <ʀᴇᴘʟʏ ᴛᴏ ɪᴍᴀɢᴇ>*
*┋ ⬡ .ᴀᴜᴛᴏʀᴇᴀᴄᴛ <ᴏɴ/ᴏғғ>*
*┋ ⬡ .ᴀᴜᴛᴏsᴛᴀᴛᴜs <ᴏɴ/ᴏғғ>*
*┋ ⬡ .ᴀᴜᴛᴏsᴛᴀᴛᴜs ʀᴇᴀᴄᴛ <ᴏɴ/ᴏғғ>*
*┋ ⬡ .ᴀᴜᴛᴏᴛʏᴘɪɴɢ <ᴏɴ/ᴏғғ>*
*┋ ⬡ .ᴀᴜᴛᴏʀᴇᴀᴅ <ᴏɴ/ᴏғғ>*
*┋ ⬡ .ᴀɴᴛɪᴄᴀʟʟ <ᴏɴ/ᴏғғ>*
*┋ ⬡ .ᴘᴍʙʟᴏᴄᴋᴇʀ <ᴏɴ/ᴏғғ/sᴛᴀᴛᴜs>*
*┋ ⬡ .ᴘᴍʙʟᴏᴄᴋᴇʀ sᴇᴛᴍsɢ <ᴛᴇxᴛ>*
*┋ ⬡ .sᴇᴛᴍᴇɴᴛɪᴏɴ <ʀᴇᴘʟʏ ᴛᴏ ᴍsɢ>*
*┋ ⬡ .ᴍᴇɴᴛɪᴏɴ <ᴏɴ/ᴏғғ>*
*╰───────────────────⳹*
`『Image/Sticker Commands:』`
*╭───────────────────⳹*
*┋ ⬡ .ʙʟᴜʀ <ɪᴍᴀɢᴇ>*
*┋ ⬡ .sɪᴍᴀɢᴇ <ʀᴇᴘʟʏ ᴛᴏ sᴛɪᴄᴋᴇʀ>*
*┋ ⬡ .sᴛɪᴄᴋᴇʀ <ʀᴇᴘʟʏ ᴛᴏ ɪᴍᴀɢᴇ>*
*┋ ⬡ .ʀᴇᴍᴏᴠᴇʙɢ*
*┋ ⬡ .ʀᴇᴍɪɴɪ*
*┋ ⬡ .ᴄʀᴏᴘ <ʀᴇᴘʟʏ ᴛᴏ ɪᴍᴀɢᴇ>*
*┋ ⬡ .ᴛɢsᴛɪᴄᴋᴇʀ <ʟɪɴᴋ>*
*┋ ⬡ .ᴍᴇᴍᴇ*
*┋ ⬡ .ᴛᴀᴋᴇ <ᴘᴀᴄᴋɴᴀᴍᴇ>*
*┋ ⬡ .ᴇᴍᴏᴊɪᴍɪx <ᴇᴍᴊ1>+<ᴇᴍᴊ2>*
*┋ ⬡ .ɪɢs <ɪɴsᴛᴀ ʟɪɴᴋ>*
*┋ ⬡ .ɪɢsᴄ <ɪɴsᴛᴀ ʟɪɴᴋ>*
*╰───────────────────⳹*
`『Pies Commands:』`
*╭───────────────────⳹*
*┋ ⬡ .ᴘɪᴇs <ᴄᴏᴜɴᴛʀʏ>*
*┋ ⬡ .ᴄʜɪɴᴀ*
*┋ ⬡ .ɪɴᴅᴏɴᴇsɪᴀ*
*┋ ⬡ .ᴊᴀᴘᴀɴ*
*┋ ⬡ .ᴋᴏʀᴇᴀ*
*┋ ⬡ .ʜɪᴊᴀʙ*
*╰───────────────────⳹*
`『Game Commands:』`
*╭───────────────────⳹*
*┋ ⬡ .ᴛɪᴄᴛᴀᴄᴛᴏᴇ @ᴜsᴇʀ*
*┋ ⬡ .ʜᴀɴɢᴍᴀɴ*
*┋ ⬡ .ɢᴜᴇss <ʟᴇᴛᴛᴇʀ>*
*┋ ⬡ .ᴛʀɪᴠɪᴀ*
*┋ ⬡ .ᴀɴsᴡᴇʀ <ᴀɴsᴡᴇʀ>*
*┋ ⬡ .ᴛʀᴜᴛʜ*
*┋ ⬡ .ᴅᴀʀᴇ*
*╰───────────────────⳹*
`『 AI Commands:』`
*╭───────────────────⳹*
*┋ ⬡ .ɢᴘᴛ <ǫᴜᴇsᴛɪᴏɴ>*
*┋ ⬡ .ɢᴇᴍɪɴɪ <ǫᴜᴇsᴛɪᴏɴ>*
*┋ ⬡ .ɪᴍᴀɢɪɴᴇ <ᴘʀᴏᴍᴘᴛ>*
*┋ ⬡ .ғʟᴜx <ᴘʀᴏᴍᴘᴛ>*
*┋ ⬡ .sᴏʀᴀ <ᴘʀᴏᴍᴘᴛ>*
*╰───────────────────⳹*
`『 Fun Commands:』`
*╭───────────────────⳹*
*┋ ⬡ .ᴄᴏᴍᴘʟɪᴍᴇɴᴛ @ᴜsᴇʀ*
*┋ ⬡ .ɪɴsᴜʟᴛ @ᴜsᴇʀ*
*┋ ⬡ .ғʟɪʀᴛ*
*┋ ⬡ .sʜᴀʏᴀʀɪ*
*┋ ⬡ .ɢᴏᴏᴅɴɪɢʜᴛ*
*┋ ⬡ .ʀᴏsᴇᴅᴀʏ*
*┋ ⬡ .ᴄʜᴀʀᴀᴄᴛᴇʀ @ᴜsᴇʀ*
*┋ ⬡ .ᴡᴀsᴛᴇᴅ @ᴜsᴇʀ*
*┋ ⬡ .sʜɪᴘ @ᴜsᴇʀ*
*┋ ⬡ .sɪᴍᴘ @ᴜsᴇʀ*
*┋ ⬡ .sᴛᴜᴘɪᴅ @ᴜsᴇʀ [ᴛᴇxᴛ]*
*╰───────────────────⳹*
`『 Textmaker:』`
*╭───────────────────⳹*
*┋ ⬡ .ᴍᴇᴛᴀʟʟɪᴄ <ᴛᴇxᴛ>*
*┋ ⬡ .ɪᴄᴇ <ᴛᴇxᴛ>*
*┋ ⬡ .sɴᴏᴡ <ᴛᴇxᴛ>*
*┋ ⬡ .ɪᴍᴘʀᴇssɪᴠᴇ <ᴛᴇxᴛ>*
*┋ ⬡ .ᴍᴀᴛʀɪx <ᴛᴇxᴛ>*
*┋ ⬡ .ʟɪɢʜᴛ <ᴛᴇxᴛ>*
*┋ ⬡ .ɴᴇᴏɴ <ᴛᴇxᴛ>*
*┋ ⬡ .ᴅᴇᴠɪʟ <ᴛᴇxᴛ>*
*┋ ⬡ .ᴘᴜʀᴘʟᴇ <ᴛᴇxᴛ>*
*┋ ⬡ .ᴛʜᴜɴᴅᴇʀ <ᴛᴇxᴛ>*
*┋ ⬡ .ʟᴇᴀᴠᴇs <ᴛᴇxᴛ>*
*┋ ⬡ .1917 <ᴛᴇxᴛ>*
*┋ ⬡ .ᴀʀᴇɴᴀ <ᴛᴇxᴛ>*
*┋ ⬡ .ʜᴀᴄᴋᴇʀ <ᴛᴇxᴛ>*
*┋ ⬡ .sᴀɴᴅ <ᴛᴇxᴛ>*
*┋ ⬡ .ʙʟᴀᴄᴋᴘɪɴᴋ <ᴛᴇxᴛ>*
*┋ ⬡ .ɢʟɪᴛᴄʜ <ᴛᴇxᴛ>*
*┋ ⬡ .ғɪʀᴇ <ᴛᴇxᴛ>*
*╰───────────────────⳹*
`『 Downloader:』`
*╭───────────────────⳹*
*┋ ⬡ .ᴘʟᴀʏ <sᴏɴɢ_ɴᴀᴍᴇ>*
*┋ ⬡ .sᴏɴɢ <sᴏɴɢ_ɴᴀᴍᴇ>*
*┋ ⬡ .sᴘᴏᴛɪғʏ <ǫᴜᴇʀʏ>*
*┋ ⬡ .ɪɴsᴛᴀɢʀᴀᴍ <ʟɪɴᴋ>*
*┋ ⬡ .ғᴀᴄᴇʙᴏᴏᴋ <ʟɪɴᴋ>*
*┋ ⬡ .ᴛɪᴋᴛᴏᴋ <ʟɪɴᴋ>*
*┋ ⬡ .ᴠɪᴅᴇᴏ <sᴏɴɢ_ɴᴀᴍᴇ>*
*┋ ⬡ .ʏᴛᴍᴘ4 <ʟɪɴᴋ>*
*╰───────────────────⳹*
`『 MISC: 』`
*╭───────────────────⳹*
*┋ ⬡ .ʜᴇᴀʀᴛ*
*┋ ⬡ .ʜᴏʀɴʏ*
*┋ ⬡ .ᴄɪʀᴄʟᴇ*
*┋ ⬡ .ʟɢʙᴛ*
*┋ ⬡ .ʟᴏʟɪᴄᴇ*
*┋ ⬡ .ɪᴛs-ꜱᴏ-ꜱᴛᴜᴘɪᴅ*
*┋ ⬡ .ɴᴀᴍᴇᴄᴀʀᴅ*
*┋ ⬡ .ᴏᴏɢᴡᴀʏ*
*┋ ⬡ .ᴛᴡᴇᴇᴛ*
*┋ ⬡ .ʏᴛᴄᴏᴍᴍᴇɴᴛ*
*┋ ⬡ .ᴄᴏᴍʀᴀᴅᴇ*
*┋ ⬡ .ɢᴀʏ*
*┋ ⬡ .ɢʟᴀss*
*┋ ⬡ .ᴊᴀɪʟ*
*┋ ⬡ .ᴘᴀssᴇᴅ*
*┋ ⬡ .ᴛʀɪɢɢᴇʀᴇᴅ*
*╰───────────────────⳹*
`『 ANIME: 』`
╔═══════════════════╗
║ ➤ .nom 
║ ➤ .poke 
║ ➤ .cry 
║ ➤ .kiss 
║ ➤ .pat 
║ ➤ .hug 
║ ➤ .wink 
║ ➤ .facepalm 
╚═══════════════════╝

╔═══════════════════╗
💻 *Github Commands:*
║ ➤ .git
║ ➤ .github
║ ➤ .sc
║ ➤ .script
║ ➤ .repo
╚═══════════════════╝

Join our channel for updates:`;

    try {
        const imagePath = path.join(__dirname, '../assets/bot_image.jpg');
        
        if (fs.existsSync(imagePath)) {
            const imageBuffer = fs.readFileSync(imagePath);
            
            await sock.sendMessage(chatId, {
                image: imageBuffer,
                caption: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363161513685998@newsletter',
                        newsletterName: 'KnightBot MD',
                        serverMessageId: -1
                    }
                }
            },{ quoted: message });
        } else {
            console.error('Bot image not found at:', imagePath);
            await sock.sendMessage(chatId, { 
                text: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363161513685998@newsletter',
                        newsletterName: 'KnightBot MD by Mr Unique Hacker',
                        serverMessageId: -1
                    } 
                }
            });
        }
    } catch (error) {
        console.error('Error in help command:', error);
        await sock.sendMessage(chatId, { text: helpMessage });
    }
}

module.exports = helpCommand;
